solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON3.h
/*! @name AUTOCLKGATEOVERRIDE0 - Automatic Clock Gate Override */
/*! @{ */

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_MASK (0x1U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_SHIFT (0U)
/*! PARTITION18 - Partition 18
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_MASK (0x2U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_SHIFT (1U)
/*! PARTITION19 - Partition 19
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_MASK (0x4U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_SHIFT (2U)
/*! PARTITION20 - Partition 20
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION21_MASK (0x8U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION21_SHIFT (3U)
/*! PARTITION21 - Partition 21
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION21(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION21_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION21_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION22_MASK (0x10U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION22_SHIFT (4U)
/*! PARTITION22 - Partition 22
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION22(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION22_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION22_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION23_MASK (0x20U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION23_SHIFT (5U)
/*! PARTITION23 - Partition 23
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION23(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION23_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION23_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION24_MASK (0x40U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION24_SHIFT (6U)
/*! PARTITION24 - Partition 24
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION24(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION24_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION24_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION25_MASK (0x80U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION25_SHIFT (7U)
/*! PARTITION25 - Partition 25
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION25(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION25_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION25_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION26_MASK (0x100U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION26_SHIFT (8U)
/*! PARTITION26 - Partition 26
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION26(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION26_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION26_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION27_MASK (0x200U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION27_SHIFT (9U)
/*! PARTITION27 - Partition 27
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION27(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION27_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION27_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION28_MASK (0x400U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION28_SHIFT (10U)
/*! PARTITION28 - Partition 28
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION28(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION28_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION28_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION29_MASK (0x800U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION29_SHIFT (11U)
/*! PARTITION29 - Partition 29
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION29(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION29_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION29_MASK)
/*! @} */

/*! @name SRAM_CLKGATE_CTRL - SRAM Clock Gating Control */
/*! @{ */

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION18_MASK (0x1U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION18_SHIFT (0U)
/*! PARTITION18 - Partition 18
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION18(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION18_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION18_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION19_MASK (0x2U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION19_SHIFT (1U)
/*! PARTITION19 - Partition 19
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION19(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION19_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION19_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION20_MASK (0x4U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION20_SHIFT (2U)
/*! PARTITION20 - Partition 20
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION20(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION20_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION20_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION21_MASK (0x8U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION21_SHIFT (3U)
/*! PARTITION21 - Partition 21
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION21(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION21_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION21_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION22_MASK (0x10U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION22_SHIFT (4U)
/*! PARTITION22 - Partition 22
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION22(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION22_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION22_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION23_MASK (0x20U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION23_SHIFT (5U)
/*! PARTITION23 - Partition 23
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION23(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION23_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION23_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION24_MASK (0x40U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION24_SHIFT (6U)
/*! PARTITION24 - Partition 24
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION24(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION24_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION24_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION25_MASK (0x80U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION25_SHIFT (7U)
/*! PARTITION25 - Partition 25
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION25(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION25_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION25_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION26_MASK (0x100U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION26_SHIFT (8U)
/*! PARTITION26 - Partition 26
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION26(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION26_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION26_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION27_MASK (0x200U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION27_SHIFT (9U)
/*! PARTITION27 - Partition 27
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION27(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION27_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION27_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION28_MASK (0x400U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION28_SHIFT (10U)
/*! PARTITION28 - Partition 28
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION28(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION28_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION28_MASK)

#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION29_MASK (0x800U)
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION29_SHIFT (11U)
/*! PARTITION29 - Partition 29
 *  0b0..Bus clock input gated
 *  0b1..No effects
 */
#define SYSCON3_SRAM_CLKGATE_CTRL_PARTITION29(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_SRAM_CLKGATE_CTRL_PARTITION29_SHIFT)) & SYSCON3_SRAM_CLKGATE_CTRL_PARTITION29_MASK)
/*! @} */

/*! @name SENSE_AUTOGATE_EN - VDD1_SENSE Auto Gating Enable */
/*! @{ */

#define SYSCON3_SENSE_AUTOGATE_EN_MATRIX_EN_MASK (0x1U)
#define SYSCON3_SENSE_AUTOGATE_EN_MATRIX_EN_SHIFT (0U)
/*! MATRIX_EN - Automatic Clock Gating Enable for S-Bus
 *  0b0..Disables clock gating (continuous clock)
 *  0b1..Enables clock gating
 */
#define SYSCON3_SENSE_AUTOGATE_EN_MATRIX_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON3_SENSE_AUTOGATE_EN_MATRIX_EN_SHIFT)) & SYSCON3_SENSE_AUTOGATE_EN_MATRIX_EN_MASK)

#define SYSCON3_SENSE_AUTOGATE_EN_BRIDGE_EN_MASK (0x2U)
#define SYSCON3_SENSE_AUTOGATE_EN_BRIDGE_EN_SHIFT (1U)
/*! BRIDGE_EN - Automatic Clock Gating Enable for AHB to APB Bridge, AIPS and AXBS
 *  0b0..Disables clock gating (continuous clock)
 *  0b1..Enables clock gating
 */
#define SYSCON3_SENSE_AUTOGATE_EN_BRIDGE_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON3_SENSE_AUTOGATE_EN_BRIDGE_EN_SHIFT)) & SYSCON3_SENSE_AUTOGATE_EN_BRIDGE_EN_MASK)
/*! @} */

/*! @name TEMPDETECT_CTRL - TEMPDETECT0 Control..TEMPDETECT1 Control */
/*! @{ */

#define SYSCON3_TEMPDETECT_CTRL_ENABLE_MASK      (0x1U)
#define SYSCON3_TEMPDETECT_CTRL_ENABLE_SHIFT     (0U)
/*! ENABLE - TEMPDETECT1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON3_TEMPDETECT_CTRL_ENABLE(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON3_TEMPDETECT_CTRL_ENABLE_SHIFT)) & SYSCON3_TEMPDETECT_CTRL_ENABLE_MASK)

#define SYSCON3_TEMPDETECT_CTRL_TEMPSEL_MASK     (0xFF0U)
#define SYSCON3_TEMPDETECT_CTRL_TEMPSEL_SHIFT    (4U)
/*! TEMPSEL - TEMPDETECT1 Temperature Select
 *  0b00000000-0b11111111..See .
 */
#define SYSCON3_TEMPDETECT_CTRL_TEMPSEL(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON3_TEMPDETECT_CTRL_TEMPSEL_SHIFT)) & SYSCON3_TEMPDETECT_CTRL_TEMPSEL_MASK)

